glocklueng/STM32Inverter/src/main.c
/**
 ******************************************************************************
 * @file    main.c
 * @author  Ac6
 * @version V1.0
 * @date    01-December-2013
 * @brief   Default main function.
 ******************************************************************************
 */

#include <stdio.h>
#include <stdint.h>

#include "stm32f10x.h"

#include "UART/usart.h"
#include "ADC/adc.h"
#include "PWM/stm32f10x_it.h"
#include "PWM/stm32f10x_conf.h"

TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
TIM_OCInitTypeDef  TIM_OCInitStructure;
TIM_BDTRInitTypeDef TIM_BDTRInitStructure;

/* Private function prototypes -----------------------------------------------*/
void RCC_Configuration(void);
void GPIO_Configuration(void);
void SysTick_Configuration(void);
void NVIC_Configuration(void);

int main(void)
{

	uart_init();
	adc_init();

	 /* System Clocks Configuration */
	  RCC_Configuration();
	  /* NVIC Configuration */
	  NVIC_Configuration();
	  /* GPIO Configuration */
	  GPIO_Configuration();
	  /* SysTick Configuration */
	  SysTick_Configuration();

	  /*-----------------------------------------------------------------------------
	  The STM32F10x TIM1 peripheral offers the possibility to program in advance the
	  configuration for the next TIM1 outputs behaviour (step) and change the configuration
	  of all the channels at the same time. This operation is possible when the COM
	  (commutation) event is used.
	  The COM event can be generated by software by setting the COM bit in the TIM1_EGR
	  register or by hardware (on TRC rising edge).
	  In this example, a software COM event is generated each 100 ms: using the Systick
	  interrupt.
	  The TIM1 is configured in Timing Mode, each time a COM event occurs,
	  a new TIM1 configuration will be set in advance.
	  The following Table  describes the TIM1 Channels states:
	              -----------------------------------------------
	             | Step1 | Step2 | Step3 | Step4 | Step5 | Step6 |
	   ----------------------------------------------------------
	  |Channel1  |   1   |   0   |   0   |   0   |   0   |   1   |
	   ----------------------------------------------------------
	  |Channel1N |   0   |   0   |   1   |   1   |   0   |   0   |
	   ----------------------------------------------------------
	  |Channel2  |   0   |   0   |   0   |   1   |   1   |   0   |
	   ----------------------------------------------------------
	  |Channel2N |   1   |   1   |   0   |   0   |   0   |   0   |
	   ----------------------------------------------------------
	  |Channel3  |   0   |   1   |   1   |   0   |   0   |   0   |
	   ----------------------------------------------------------
	  |Channel3N |   0   |   0   |   0   |   0   |   1   |   1   |
	   ----------------------------------------------------------
	  -----------------------------------------------------------------------------*/

	  /* Time Base configuration */
	  TIM_TimeBaseStructure.TIM_Prescaler = 0;
	  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	  TIM_TimeBaseStructure.TIM_Period = 4095;
	  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	  TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;

	  TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure);

	  /* Channel 1, 2,3 and 4 Configuration in PWM mode */
	  TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_Timing;
	  TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	  TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;
	  TIM_OCInitStructure.TIM_Pulse = 2047;
	  TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	  TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High;
	  TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
	  TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCNIdleState_Set;

	  TIM_OC1Init(TIM1, &TIM_OCInitStructure);

	  TIM_OCInitStructure.TIM_Pulse = 1023;
	  TIM_OC2Init(TIM1, &TIM_OCInitStructure);

	  TIM_OCInitStructure.TIM_Pulse = 511;
	  TIM_OC3Init(TIM1, &TIM_OCInitStructure);

	  /* Automatic Output enable, Break, dead time and lock configuration*/
	  TIM_BDTRInitStructure.TIM_OSSRState = TIM_OSSRState_Enable;
	  TIM_BDTRInitStructure.TIM_OSSIState = TIM_OSSIState_Enable;
	  TIM_BDTRInitStructure.TIM_LOCKLevel = TIM_LOCKLevel_OFF;
	  TIM_BDTRInitStructure.TIM_DeadTime = 1;
	  TIM_BDTRInitStructure.TIM_Break = TIM_Break_Enable;
	  TIM_BDTRInitStructure.TIM_BreakPolarity = TIM_BreakPolarity_High;
	  TIM_BDTRInitStructure.TIM_AutomaticOutput = TIM_AutomaticOutput_Enable;

	  TIM_BDTRConfig(TIM1, &TIM_BDTRInitStructure);

	  TIM_CCPreloadControl(TIM1, ENABLE);

	  TIM_ITConfig(TIM1, TIM_IT_COM, ENABLE);

	  /* TIM1 counter enable */
	  TIM_Cmd(TIM1, ENABLE);

	  /* Main Output Enable */
	  TIM_CtrlPWMOutputs(TIM1, ENABLE);


	while (1)
	{
		uint16_t adc = ADC_GetConversionValue(ADC1);
		uint8_t req_frequency = adc * 0.0122;
		printf("Required frequency = %d\n", req_frequency);
	}
}

void RCC_Configuration(void)
{
  /* TIM1, GPIOA, GPIOB, GPIOE and AFIO clocks enable */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1 | RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOE|
                         RCC_APB2Periph_GPIOB |RCC_APB2Periph_AFIO, ENABLE);
}

/**
  * @brief  Configure the TIM1 Pins.
  * @param  None
  * @retval None
  */
void GPIO_Configuration(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* GPIOA Configuration: Channel 1, 2 and 3 as alternate function push-pull */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);

  /* GPIOB Configuration: Channel 1N, 2N and 3N as alternate function push-pull */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  /* GPIOB Configuration: BKIN pin */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

}

/**
  * @brief  Configures the SysTick.
  * @param  None
  * @retval None
  */
void SysTick_Configuration(void)
{
  /* Setup SysTick Timer for 100 msec interrupts  */
  if (SysTick_Config((SystemCoreClock) / 10))
  {
    /* Capture error */
    while (1);
  }

   NVIC_SetPriority(SysTick_IRQn, 0x0);
}

/**
  * @brief  Configures the nested vectored interrupt controller.
  * @param  None
  * @retval None
  */
void NVIC_Configuration(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;

  /* Enable the TIM1 Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = TIM1_TRG_COM_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}
